{"content": {"content": [{"o": 151, "f": null, "c": "This week NZ Herald published an [article](http://www.nzherald.co.nz/technology/news/article.cfm?c_id=5&objectid=11469418)\nabout a device created by an Irish farmer enterpreneur that sends a message to a farmer when the cow is about to give birth.\nThe device monitors \"heightened tail moviment\".\n\nIn this post I will try to apply what I am learning following the [SOS Tutorial](http://www.ogcnetwork.net/SOS_2_0/tutorial)\n(the Open Geospatial Consortium standard for Sensor Observation Service). Feel free to drop me a message via\n[@kinow](https://twitter.com/kinow) if you find any mistakes or have any suggestions.\n\n## Modeling the tail moviment observation data in SOS\n\nSOS is a standard designed to provide access to observation data. There are several server implementations, such as Kisters KiWIS, \nistSOS and 52North SOS.\n\nThe standard mentions and utilises several other standards, such as SensorML, WFS, XML, WMS, etc. The SOS Tutorial on\nhow to model your observation data for SOS starts by defining *procedure*, *observed property*, *feature of interest*,\n*phenomenon and result times*, and the *result value*.\n\nLet's try to model the data from the tail moviment sensors in the following table.\n\n<table class=\"table table-bordered\">\n<thead>\n<tr>\n<th>Name</th>\n<th>Description</th>\n<th>Our example</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<th>Procedure</th>\n<td>The process that has generated the observation, such as a sensor, from the O&M specification. In our example that could be a sensor identification</td>\n<td>moocall_001</td>\n</tr>\n<tr>\n<th>Observed Property</th>\n<td>A property which is observed (look at NASA SWEET ontology for existing values)</td>\n<td>Heightned tail moviment</td>\n</tr>\n<tr>\n<th>Feature of Interest</th>\n<td>A feature that carries the property which is observed</td>\n<td>Pregnant cow</td>\n</tr>\n<tr>\n<th>Phenomenon and Result Times</th>\n<td>The phenomenon time is when the data has been taken, and the result time when it has been created. If both are the same, the resultTime can point to the phenomenonTime</td>\n<td>20150623142000</td>\n</tr>\n<tr>\n<th>Result value</th>\n<td>This is the result of the observation. Can be a OM_Measurement if numeric, OM_TruthObservation, etc (O&M)</td>\n<td>3 (supposing we have a scale from 1 to 5)</td>\n</tr>\n</tbody>\n</table>\n\nIn the next post I will try to show how to load this model and some dummy data into a fresh installation of\n52North SOS server.", "l": 8}]}, "config": {"title": "Modeling observation data in SOS (Sensor Observation Service)", "author": "kinow", "tags": ["sensor web"], "category": "blog", "time": "13:40:03", "format": null, "content_type": "html", "segments": ["content"]}}